import 'package:Fitness/widgets/AppColors.dart';
import 'package:Fitness/widgets/CustomText.dart';
import 'package:flutter/material.dart';

class CompleteReadingText extends StatelessWidget {
  const CompleteReadingText({Key key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Container(
      margin: EdgeInsets.symmetric(horizontal: 20),
      width: double.infinity,
      child: Column(
        children: [
          CustomText(
            title: 'ولا يتطلب الحصول على أي معدات خاصة. فهم التأمل كانت تتم ممارسة التأمل منذ آلاف السنين. كان الهدف من التأمل في الأصل هو المساعدة في تعميق فهم قوى الحياة المقدسة والصوفية. في هذه الأيام، يستخدم التأمل عادةً للاسترخاء وتقليل الضغط العصبي. عتبر التأمل نوعًا من الطب التكميلي للعقل والجسم. ويمكن للتأمل خلق حالة عميقة من الاسترخاء والشعور الطمأنينة. في أثناء التأمل، تقوم بتركيز انتباهك، وإبعاد سلسلة الأفكار المشوشة التي قد تجعل عقلك مزدحمًا تسبب له لضغط العصبي. وقد تؤدي هذه العملية إلى تحسين الصحة الجسدية والعاطفية. فوائد التأمل مكن للتأمل أن يوفر لك الشعور بالهدوء والسلام والتوازن الذي يمكن أن يفيد كلاً من صحتك النفسية وصحتك العامة. هذه الفوائد لا تنتهي بانتهاء جلسات التأمل. فالتأمل يمكن أن يساعدك على التحلي بمزيد من الهدوء طوال اليوم وفي السيطرة على أعراض حالات طبية معينة.لتأمل والصحة النفسية عند ممارسة التأمل، فأنت تمسح المعلومات الزائدة التي تتراكم كل يوم مسببة لك الضغط النفسي.',
            size: 16,
            color: AppColors.blackOpacity,
            align: TextAlign.start,
          ),
          SizedBox(
            height: 10,
          ),
          CustomText(
            title: 'ولا يتطلب الحصول على أي معدات خاصة. فهم التأمل كانت تتم ممارسة التأمل منذ آلاف السنين. كان الهدف من التأمل في الأصل هو المساعدة في تعميق فهم قوى الحياة المقدسة والصوفية. في هذه الأيام، يستخدم التأمل عادةً للاسترخاء وتقليل الضغط العصبي. عتبر التأمل نوعًا من الطب التكميلي للعقل والجسم. ويمكن للتأمل خلق حالة عميقة من الاسترخاء والشعور الطمأنينة. في أثناء التأمل، تقوم بتركيز انتباهك، وإبعاد سلسلة الأفكار المشوشة التي قد تجعل عقلك مزدحمًا تسبب له لضغط العصبي. وقد تؤدي هذه العملية إلى تحسين الصحة الجسدية والعاطفية. فوائد التأمل مكن للتأمل أن يوفر لك الشعور بالهدوء والسلام والتوازن الذي يمكن أن يفيد كلاً من صحتك النفسية وصحتك العامة. هذه الفوائد لا تنتهي بانتهاء جلسات التأمل. فالتأمل يمكن أن يساعدك على التحلي بمزيد من الهدوء طوال اليوم وفي السيطرة على أعراض حالات طبية معينة.لتأمل والصحة النفسية عند ممارسة التأمل، فأنت تمسح المعلومات الزائدة التي تتراكم كل يوم مسببة لك الضغط النفسي.',
            size: 16,
            color: AppColors.blackOpacity,
          ),
        ],
      ),
    );
  }
}
